<template>
  <fieldset>
    <comp-01></comp-01>
    <comp-02></comp-02>
    <!--
        <Comp01></Comp01>
    -->
    <Comp02></Comp02>
  </fieldset>
</template>

<script>
// https://v3.vuejs.org/guide/component-registration.html

import comp01 from './component-registration.01.vue';
import comp02 from './component-registration.02.vue';

/*----------------------------------------------------------------------------------------------------
 * 组件注册有两种：全局注册 和 本地注册，
 * 全局注册的组件可以在任意地方使用，
 * 本地注册的组件只能在当前组件使用，在子组件中也不能使用，
 *----------------------------------------------------------------------------------------------------*/

export default {
  components: {
    /*----------------------------------------------------------------------------------------------------
     * 如果注册的组件名为 kebab-case，则在 template 中只能使用 kebab-case，
     *----------------------------------------------------------------------------------------------------*/
    'comp-01': comp01,
    /*----------------------------------------------------------------------------------------------------
     * 如果注册的组件名为 PascalCase，则在 template 中可以使用 PascalCase 或者 kebab-case，
     *----------------------------------------------------------------------------------------------------*/
    Comp02: comp02,
  },
};
</script>
